---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.SourceInEditMode
source: html/405ed4dd-ada5-cf68-2125-ae7b739ea07b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.SourceInEditMode Property

Can't transfer project standards while source document is in an edit mode. Please exit all edit modes(In-Place
 Family Edit Mode, Group Edit Mode, Sketch Edit Mode, etc.) and try again.

## Syntax (C#)
```csharp
public static FailureDefinitionId SourceInEditMode { get; }
```